app/views/projects/index.html.erb

SELECT  "projects".* FROM "projects" ORDER BY "projects"."id" ASC LIMIT ?  [["LIMIT", 1000]]
---
<div class="row">
    <%= Project.find_each do |project| %>

SELECT  "todos".* FROM "todos" WHERE "todos"."project_id" = ? ORDER BY "todos"."id" ASC LIMIT ?  [["project_id", 10], ["LIMIT", 1000]]
---
              <ul>
                <%= project.todos.find_each do |todo| %>