app/controllers/projects_controller.rb

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("title", "created_at", "updated_at") VALUES (?, ?, ?)  [["title", "My project"], ["created_at", "2018-06-19 17:27:49.625590"], ["updated_at", "2018-06-19 17:27:49.625590"]]