app/controllers/todos_controller.rb

  def create
    @todo = Todo.new(todo_params)
    respond_to do |format|
      if @todo.save
---
INSERT INTO "todos" ("text", "isCompleted", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "one"], ["isCompleted", 0], ["project_id", 10], ["created_at", "2018-06-21 23:23:00.463123"], ["updated_at", "2018-06-21 23:23:00.463123"]]

  def update
    respond_to do |format|
      if @todo.update(todo_params)
---
UPDATE "todos" SET "isCompleted" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["isCompleted", 0], ["updated_at", "2018-06-21 23:21:00.650882"], ["id", 94]]